test/fixtures/xml/fedex/request1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
         <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key>rscqm75MLampLUuV</v13:Key>
               <v13:Password>8rTZHQ6vbyOsGOgtwMXrZ1kIU</v13:Password>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber>510087267</v13:AccountNumber>
            <v13:MeterNumber>118511895</v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>PRIORITY_OVERNIGHT</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2010-10-18T13:00:00-06:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>PRIORITY_OVERNIGHT</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:TotalWeight>
               <v13:Units>LB</v13:Units>
               <v13:Value>80</v13:Value>
            </v13:TotalWeight>
            <v13:TotalInsuredValue>
               <v13:Currency>CAD</v13:Currency>
               <v13:Amount>50</v13:Amount>
            </v13:TotalInsuredValue>
            <v13:Shipper>
               <v13:AccountNumber/>
               <v13:Tins>
                  <v13:TinType>PERSONAL_STATE</v13:TinType>
                  <v13:Number>1057</v13:Number>
               </v13:Tins>
               <v13:Contact>
                  <v13:ContactId>RB50596</v13:ContactId>
                  <v13:PersonName>ROHIT BORSE</v13:PersonName>
                  <v13:Title>ROHIT</v13:Title>
                  <v13:CompanyName>SYNTEL INTERNATIONAL</v13:CompanyName>
                  <v13:PhoneNumber>9762308621</v13:PhoneNumber>
                  <v13:PhoneExtension>02213469</v13:PhoneExtension>
                  <v13:PagerNumber>02213469</v13:PagerNumber>
                  <v13:FaxNumber>02213469</v13:FaxNumber>
                  <v13:EMailAddress>Rohit_Borse@syntelinc.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>RECIPIENT ADDRESS LINE</v13:StreetLines>
                  <v13:City>ETOBICOKE</v13:City>
                  <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
                  <v13:PostalCode>M9C5K6</v13:PostalCode>
                  <v13:UrbanizationCode>ON</v13:UrbanizationCode>
                  <v13:CountryCode>CA</v13:CountryCode>
                  <v13:Residential>1</v13:Residential>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:AccountNumber/>
               <v13:Tins>
                  <v13:TinType>PERSONAL_STATE</v13:TinType>
                  <v13:Number>0705</v13:Number>
               </v13:Tins>
               <v13:Contact>
                  <v13:PersonName>DEOYANEE BHADANE</v13:PersonName>
                  <v13:Title>DEOYANEE</v13:Title>
                  <v13:CompanyName>SYNTEL INTERNATIONAL</v13:CompanyName>
                  <v13:PhoneNumber>9762308621</v13:PhoneNumber>
                  <v13:PhoneExtension>02213469</v13:PhoneExtension>
                  <v13:PagerNumber>02213469</v13:PagerNumber>
                  <v13:FaxNumber>02213469</v13:FaxNumber>
                  <v13:EMailAddress>DeoyaRohit0705$@gmail.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>RECIPIENT ADDRESS LINE</v13:StreetLines>
                  <v13:City>ETOBICOKE</v13:City>
                  <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
                  <v13:PostalCode>M9C5K6</v13:PostalCode>
                  <v13:UrbanizationCode>ON</v13:UrbanizationCode>
                  <v13:CountryCode>CA</v13:CountryCode>
                  <v13:Residential>1</v13:Residential>
               </v13:Address>
            </v13:Recipient>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber/>
                     <v13:Tins>
                        <v13:TinType>BUSINESS_STATE</v13:TinType>
                        <v13:Number>123456</v13:Number>
                     </v13:Tins>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:CustomsClearanceDetail>
               <v13:Brokers>
                  <v13:Broker>
                     <v13:AccountNumber/>
                     <v13:Tins>
                        <v13:TinType>PERSONAL_STATE</v13:TinType>
                        <v13:Number>1234</v13:Number>
                        <v13:Usage>UsageString</v13:Usage>
                     </v13:Tins>
                     <v13:Contact>
                        <v13:ContactId>PP</v13:ContactId>
                        <v13:PersonName>PRAMOD PATIL</v13:PersonName>
                        <v13:Title>PRAMOD</v13:Title>
                        <v13:CompanyName>DEOYAROHIT0705$</v13:CompanyName>
                        <v13:PhoneNumber>9763056122</v13:PhoneNumber>
                        <v13:PhoneExtension>02213469</v13:PhoneExtension>
                        <v13:PagerNumber>02213469</v13:PagerNumber>
                        <v13:FaxNumber>02213469</v13:FaxNumber>
                        <v13:EMailAddress>PramodPatil@gmail.com</v13:EMailAddress>
                     </v13:Contact>
                     <v13:Address>
                        <v13:StreetLines>BROKER ADDRESS LINE</v13:StreetLines>
                        <v13:City>ETOBICOKE</v13:City>
                        <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
                        <v13:PostalCode>M9C5K6</v13:PostalCode>
                        <v13:UrbanizationCode>ON</v13:UrbanizationCode>
                        <v13:CountryCode>CA</v13:CountryCode>
                        <v13:Residential>0</v13:Residential>
                     </v13:Address>
                  </v13:Broker>
               </v13:Brokers>
               <v13:ClearanceBrokerage>BROKER_INCLUSIVE</v13:ClearanceBrokerage>
               <v13:ImporterOfRecord>
                  <v13:AccountNumber/>
                  <v13:Tins>
                     <v13:TinType>PERSONAL_STATE</v13:TinType>
                     <v13:Number>5678</v13:Number>
                     <v13:Usage>UsageString</v13:Usage>
                  </v13:Tins>
                  <v13:Contact>
                     <v13:ContactId>BP</v13:ContactId>
                     <v13:PersonName>BHUSHAN PATIL</v13:PersonName>
                     <v13:Title>BHUSHAN</v13:Title>
                     <v13:CompanyName>DEOYAROHIT0705$</v13:CompanyName>
                     <v13:PhoneNumber>9763056122</v13:PhoneNumber>
                     <v13:PhoneExtension>02213469</v13:PhoneExtension>
                     <v13:PagerNumber>02213469</v13:PagerNumber>
                     <v13:FaxNumber>02213469</v13:FaxNumber>
                     <v13:EMailAddress>BhushanPatil@gmail.com</v13:EMailAddress>
                  </v13:Contact>
                  <v13:Address>
                     <v13:StreetLines>IMPORTER ADDRESS LINE</v13:StreetLines>
                     <v13:City>ETOBICOKE</v13:City>
                     <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
                     <v13:PostalCode>M9C5K6</v13:PostalCode>
                     <v13:UrbanizationCode>ON</v13:UrbanizationCode>
                     <v13:CountryCode>CA</v13:CountryCode>
                     <v13:Residential>0</v13:Residential>
                  </v13:Address>
               </v13:ImporterOfRecord>
               <v13:RecipientCustomsId>
                  <v13:Type>INDIVIDUAL</v13:Type>
                  <v13:Value>0705</v13:Value>
               </v13:RecipientCustomsId>
               <v13:DutiesPayment>
                  <v13:PaymentType>SENDER</v13:PaymentType>
                  <v13:Payor>
                     <v13:ResponsibleParty>
                        <v13:AccountNumber/>
                        <v13:Tins>
                           <v13:TinType>BUSINESS_STATE</v13:TinType>
                           <v13:Number>123456</v13:Number>
                        </v13:Tins>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:DocumentContent>DOCUMENTS_ONLY</v13:DocumentContent>
               <v13:CustomsValue>
                  <v13:Currency>CAD</v13:Currency>
                  <v13:Amount>50.0</v13:Amount>
               </v13:CustomsValue>
               <v13:FreightOnValue>CARRIER_RISK</v13:FreightOnValue>
               <v13:InsuranceCharges>
                  <v13:Currency>CAD</v13:Currency>
                  <v13:Amount>50.0</v13:Amount>
               </v13:InsuranceCharges>
               <v13:PartiesToTransactionAreRelated>1</v13:PartiesToTransactionAreRelated>
               <v13:CommercialInvoice>
                  <v13:Comments>CommercialInvoice</v13:Comments>
                  <v13:FreightCharge>
                     <v13:Currency>CAD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:FreightCharge>
                  <v13:TaxesOrMiscellaneousCharge>
                     <v13:Currency>CAD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:TaxesOrMiscellaneousCharge>
                  <v13:PackingCosts>
                     <v13:Currency>CAD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:PackingCosts>
                  <v13:HandlingCosts>
                     <v13:Currency>CAD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:HandlingCosts>
                  <v13:SpecialInstructions>HANDLE WITH CARE</v13:SpecialInstructions>
                  <v13:DeclarationStatement>DeclarationStatmentString</v13:DeclarationStatement>
                  <v13:PaymentTerms>PaymentTermsString</v13:PaymentTerms>
                  <v13:Purpose>GIFT</v13:Purpose>
                  <v13:OriginatorName>ROHIT</v13:OriginatorName>
                  <v13:TermsOfSale>FOB_OR_FCA</v13:TermsOfSale>
               </v13:CommercialInvoice>
               <v13:Commodities>
                  <v13:Name>CommoditiesName</v13:Name>
                  <v13:NumberOfPieces>15</v13:NumberOfPieces>
                  <v13:Description>COMMODITY WITH 15 PIECES</v13:Description>
                  <v13:CountryOfManufacture>CA</v13:CountryOfManufacture>
                  <v13:HarmonizedCode>DRB10570705$</v13:HarmonizedCode>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>80</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>15</v13:Quantity>
                  <v13:QuantityUnits>QuantityUnits</v13:QuantityUnits>
                  <v13:AdditionalMeasures>
                     <v13:Quantity>15</v13:Quantity>
                     <v13:Units>AdditionalMeasuresUnits</v13:Units>
                  </v13:AdditionalMeasures>
                  <v13:UnitPrice>
                     <v13:Currency>CAD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:UnitPrice>
                  <v13:CustomsValue>
                     <v13:Currency>CAD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:CustomsValue>
                  <v13:ExciseConditions>
                     <v13:Category>CategoryString</v13:Category>
                     <v13:Value>ValueString</v13:Value>
                  </v13:ExciseConditions>
                  <v13:ExportLicenseNumber>ExportLicenseNumberString</v13:ExportLicenseNumber>
                  <v13:ExportLicenseExpirationDate>2012-06-02</v13:ExportLicenseExpirationDate>
                  <v13:CIMarksAndNumbers>CIMarksAndNumbersString</v13:CIMarksAndNumbers>
               </v13:Commodities>
               <v13:ExportDetail>
                  <v13:B13AFilingOption>FILED_ELECTRONICALLY</v13:B13AFilingOption>
                  <v13:ExportComplianceStatement>30.37(f)</v13:ExportComplianceStatement>
                  <v13:PermitNumber>PermitNumberString</v13:PermitNumber>
                  <v13:DestinationControlDetail>
                     <v13:StatementTypes>DEPARTMENT_OF_COMMERCE</v13:StatementTypes>
                     <v13:DestinationCountries>CA</v13:DestinationCountries>
                     <v13:EndUser>DEOYANEE BHADANE</v13:EndUser>
                  </v13:DestinationControlDetail>
               </v13:ExportDetail>
               <v13:RegulatoryControls>EU_CIRCULATION</v13:RegulatoryControls>
            </v13:CustomsClearanceDetail>
            <v13:LabelSpecification>
               <v13:LabelFormatType>COMMON2D</v13:LabelFormatType>
               <v13:ImageType>PNG</v13:ImageType>
               <v13:LabelStockType>PAPER_4X6</v13:LabelStockType>
            </v13:LabelSpecification>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupNumber>1</v13:GroupNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:InsuredValue>
                  <v13:Currency>CAD</v13:Currency>
                  <v13:Amount>50</v13:Amount>
               </v13:InsuredValue>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>100</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>12</v13:Length>
                  <v13:Width>12</v13:Width>
                  <v13:Height>12</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:Dimensions>
               <v13:PhysicalPackaging>ENVELOPE</v13:PhysicalPackaging>
               <v13:ItemDescription>ToDeoFromRohit</v13:ItemDescription>
               <v13:CustomerReferences>
                  <v13:CustomerReferenceType>CUSTOMER_REFERENCE</v13:CustomerReferenceType>
                  <v13:Value>DRB0705</v13:Value>
               </v13:CustomerReferences>
               <v13:ContentRecords>
                  <v13:PartNumber>String</v13:PartNumber>
                  <v13:ItemNumber>String</v13:ItemNumber>
                  <v13:ReceivedQuantity>1</v13:ReceivedQuantity>
                  <v13:Description>ToDeoFromRohit</v13:Description>
               </v13:ContentRecords>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>